# -*- coding: utf8 -*-

"""
Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

Пример:

- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]
"""

data_1 = [2, 3, 4, 5, 6]
data_2 = [2, 3, 5, 6]


def magic(data):
    return print([data[i]*data[-1-i] for i, _ in enumerate(data) if i < len(data)/2])


magic(data_1)
magic(data_2)
